Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, BLUE.tmx
Source language: id
Languages: en

source: BANGUN KAMU!
en: wake up!

source: kalau sam..
en: as for samuel...

source: a-aku juga lupa...
en: I-I don’t seem to remember it...

source: waktu pertama kali kamu menyadari kehadiranku..
en: the first time you became aware of my presence.

source: waa bahaya!!
en: don’t look!

source: Kamu tahu kenapa Caca mencari kerja di kampung ini padahal dia sarjana komputer?
en: do you know why caca looked for work in this town despite the fact that he was an IT graduate?

source: wanita terlembut yang pernah kutemui..
en: she was the gentlest soul I've ever encountered.

source: soalnya ada aku
en: yeah, because I’m here.

source: gapapa
en: it’s okay.

source: sebenarnya...
en: actually...

source: ADUDUH..
en: ouch...

source: dompetmu hilang?
en: you lost your wallet?

source: ah engga buat ibu aja deh
en: no, you can take it with you.

source: rasanya seperti kembali ke titik terendahku
en: ...I felt like I had hit rock bottom once again.

source: telpon siapa malem-malem?
en: who did you call at this hour?

source: jadi kita...
en: so, do we...

source: APA LAGI LIAT SESUATU?
en: looking at something in particular?

source: Aku, bebeng, dan sam jadi jarang main.
en: as a result, samuel, bebeng, and I barely see each other.

source: tidur..
en: he’s asleep...

source: aku mau bilang padamu..
en: we wanted to.

source: nyem
en: nom

source: hah?!!
en: what?!

source: tok
en: tap

source: kalian mau berteman dengannya?
en: ...want to be friends with him?

source: kenapa bu?
en: sure.

source: kalau jim itu seseorang bernama damar..
en: if jimmy was someone named damar...

source: lalu kenapa aku...
en: and why am I...

source: thankyou beng!!
en: thanks, bebeng!

source: capek banget nih
en: I’m so tired.

source: i-ini jim!
en: th-this is jimmy!

source: ctik
en: click

source: kamu gapapa?
en: are you okay?

source: kritt
en: screech

source: aku masih bingung kenapa setan punya kacamata
en: I'm still perplexed as to why a ghost would wear glasses.

source: hah? mabok ya?
en: what? are you drunk?

source: jim!
en: jimmy!

source: i-ini jim! jim yang suka main bareng kalian!
en: this is jimmy! the one who played with you guys!

source: kenapa jim bisa-bisanya jago main game ya?
en: I wonder why he’s good at video games?

source: gausah kamu istirahat aja
en: I’m okay. you should take a rest.

source: aku banyak berpikir begitu!
en: I often think about it!

source: aku mikirin gimana bebeng kalau kurus..
en: I'd imagine what bebeng would look like if he was slimmer.

source: waktu di rumah sakit juga kamu bilang ‘mau hidup dengan alasan apapun’..?
en: at the hospital, you said, “I just wanna live without particular reasons”.

source: ...jim
en: jimmy does

source: e-ehehe.. engga pak
en: hehe, it’s nothing, sir.

source: hah matamu minus?
en: you’re nearsighted?

source: aku jadi jarang melihat jim
en: ...I rarely saw jimmy again.

source: karena kerja di mall aku jadi suka merasa hedon di sini.. ‘aku mau makan itu!,, aku mau parfum itu!”
en: ever since working in the mall, I became reckless with money. wanting to eat out or buy some perfume

source: Aku menyayangimu Juni
en: I love you, juni.

source: damar itu nama temennya bebeng dan sam yang lagi sakit kan?
en: isn't it the name of bebeng and samuel's friend who’s hospitalized?

source: OH GITU YA?
en: are you sure?

source: apa temanku juga?
en: is he also my friend?

source: waaah!
en: wow...

source: bersambung
en: to be continued

source: aku pernah jatuh kayak gitu waktu kecil..?
en: did I ever fall like that when I was younger?

source: kenapa semua jadi begini sih..?
en: how did it come to this?

source: kamu akan baik-baik saja juni
en: you’ll be alright, juni.

source: mencari temanku
en: ...looking for my friend.

source: aku masih hidup??
en: am I still alive?

source: ciee malaa yoyoo!!
en: awww, mala and yoyo!

source: juni ya..?
en: ...you’re juni, right?

source: aku ngga kenal mereka sebelumnya-
en: I didn’t know them before...

source: ..jim?
en: jimmy?

source: neng gapapa?!
en: are you okay?!

source: ini sih jim...
en: this is jimmy.

source: kuenya?!
en: the chocolate brownie...

source: kamu cantik dikalangan kuntilanak dan kolong wewe
en: you’re the prettiest among kuntilanak and wewe gombel.

source: terserah mau kamu pakai apa
en: you’re free to spend the money on whatever you like.

source: halo...?
en: hello?

source: srek
en: rustle

source: barusan kok, tapi lewat belakang..
en: just now, through the back entrance.

source: kamu masih penasaran wujud manusiamu?
en: do you still wonder about your human appearance?

source: apa jangan-jangan sudah sadar?
en: or has he regained consciousness?

source: tes
en: plop

source: kamu..
en: what in the world...

source: Aku mengingatnya seperti kejadian itu baru terjadi kemarin
en: to me, it was as if it had happened yesterday.

source: harap baca webtoon kolak episode 16 untuk tahu ceritanya
en: please read webtoon kolak’s episode 16 to grasp the plot.

source: karna tentu saja mustahil menemukan identitas orang hanya dari kacamatanya saja
en: because it was impossible to identify someone based on the glasses they wore.

source: oi juni!
en: hey, juni!

source: sudah beberapa hari ini aku tidak melihat jim
en: it had been a while since I didn’t see jimmy.

source: ...sampai kamu pergi
en: ...until you were gone.

source: ke pasar yang di belakang sekolah kan?
en: to the market behind the school, right?

source: setan yang mengikutiku
en: he was just the ghost who followed me.

source: tunggu!
en: wait up!

source: srrrr
en: whirrr

source: TAPI KAKEKNYA DIEM AJA SIH
en: but he didn’t move an inch.

source: m-masuk tante!
en: p-please come in.

source: selama ini dia juga ikut nge band lagi
en: he played in a band as well.

source: tumben anteng
en: he’s so quiet.

source: tik
en: click

source: itu si yoyo ngelamar si mala
en: yoyo has proposed to mala.

source: kupikir ingatan semua orang tentang masa kecilnya memang serabun itu
en: I thought it was normal for people to have blurry childhood memories.

source: lalu bebeng dan sam..? kenapa aku punya biodata mereka?
en: why do i have bebeng and sam’s profile?

source: Tapi aku selalu melihatmu dari jauh
en: but I always watch you from afar.

source: aku sudah jauh-jauh ke kantor polisi, ke sekolah malem-malem, ke sd lamaku, ke pasar buat nyari kacamata dia! dll terus kamu bilang dia bohong?!
en: I went all the way to the police station, to the school at night, to our elementary school, and to the market to look for his spectacles, and you're telling me he's been lying?!

source: lalu kenapa?
en: then what?

source: jin itu terbentuk wujudnya dari macam-macam, salah satunya memori manusianya
en: jinns would appear in various shapes, one of which was the appearance of when they used to be human.

source: aku tidak bertahan lama dengan pekerjaan itu
en: I quit that job not long after.

source: sabar dulu kenapa!
en: be patient!

source: waa
en: chatter

source: ada pocong!
en: I saw a pocong!

source: aduh!
en: ouch!

source: ini sebenarnya permintaan damar
en: actually, these are damar’s will.

source: eh tapi kadang aku juga mikirin sesuatu
en: but sometimes I think about something.

source: maksudnya sebelum kita temenan!
en: I mean before we became friends!

source: -M..
en: ...my?

source: iya sih, kuntilanak aja punya gamis
en: yeah, no wonder the kuntilanak* wears a nightgown.

source: sampai kamu melupakan hal-hal kecil dulu
en: ...that you had forgotten every details of your past...

source: kenapa lama banget sih datengnyaa!!
en: what took you so long!

source: ayo masuk, masuk!
en: come on in!

source: trak!
en: thud

source: e-engga usah
en: n-no, it’s fine.

source: kalau pada akhirnya kamu mati
en: if you ended up killing yourself...

source: SRAK
en: rustle

source: kamu menghilang kemana...
en: where you’ve been disappearing to...

source: bak
en: pow

source: oh biodata?
en: a biodata?

source: loh udah sampai?
en: oh, you’re here already?

source: kebanyakan baca komik serial cantiknya bebeng kamu
en: you’ve been reading bebeng’s romance comics too much.

source: emang bisa jim?
en: can you, jimmy?

source: lagi gosip hantu pak
en: oh, we’re talking about a ghost.

source: aku..
en: I’m...

source: tadi kulihat kamu ke toko kacamata yang emperan itu ya?
en: I saw you went to the glasses seller at the street.

source: kamu bikin aku bingung tau ngga ?!!
en: you made me confused!

source: aku ngga bilang padamu karena aku..
en: I didn’t tell you about it because I...

source: dengan alasan apapun
en: ...without any particular reason.

source: lebih baik begini
en: it’d be best if things stayed this way.

source: berharap ada sedikit kenangan baik menyambutku, tapi apa?
en: ...hoping to be welcomed by warm nostalgia. but instead...

source: karena hari-hari berikutnya jim kembali menghilang dariku
en: because in the following days, jimmy kept disappearing.

source: terus apa lagi?
en: what else?

source: kan bener kann yang aslinya muncul kann!!
en: what did i tell you, the real ghost really came!

source: konon katanya dia mendaki gunung, menuruni lembah untuk mencari rumah yuan di desanya
en: he ascended mountains and descended valleys in quest of Yuan's house.

source: kan kamu yang bilang sendiri jim itu hantu yang ngga ingat apa-apa?
en: you said yourself that jimmy was a ghost who knew nothing about himself.

source: *acara prank jaman dulu
en: *an Indonesian TV prank show

source: haaah..
en: haaa

source: engga bu sendiri aja
en: nope, I’ll go by myself.

source: apanih ?
en: what is this?

source: ini...
en: isn’t this...

source: kok lama sampainya?
en: what took you so long?

source: yoyo bisa ke rumah mala gak ?
en: yoyo, can you go to mala’s house?

source: cuit
en: chirp

source: oh ya?
en: oh really?

source: SEKARANG MIKIRIN APA?
en: penny for your thoughts?

source: nonton film ini yuk
en: let’s watch this movie.

source: bebeng dan sam dimana ya?
en: have you seen bebeng and samuel?

source: MALAH BERCAHAYA..
en: and even he shines.

source: *tunjangan hari raya
en: *religious holiday allowance, or simply THR, refers to an annual bonus of one month's salary given to employees before the start of a religious holiday.

source: bohong.
en: you’re lying.

source: pak jual kacamata merk rodens ngga?
en: do you sell rodens’ glasses here?

source: begitu lah..
en: that’s bebeng.

source: sejak kapan kalian mulai berinteraksi ?
en: since when did you two begin communicating?

source: trak
en: clack

source: ya?
en: yes?

source: terus...
en: and...

source: aku ngga pernah cerita pada siapapun soal kecelakaan orangtuaku...
en: I never told anyone about my parents’ accident.

source: sst aku merasakan energi yang kuat di sini..
en: shush, I'm feeling a tremendous amount of energy here.

source: aku tidak punya apa-apa, aku tidak punya siapa-siapa..
en: I don’t have anything, I don’t have anyone.

source: oh kirain..
en: oh, I thought it was him.

source: dan beginilah keluarga jadi-jadianku
en: they’re like a family to me.

source: toko terakhir
en: the last store

source: sini naik, tidur di sini aja dulu
en: come up. you can sleep here.

source: ngga jual juga kok
en: he never sold them either.

source: SAMPE AKU MENIKAH GIMANA?
en: how about until I’m married?

source: ..semuanya jadi tidak penting juni
en: ...would mean nothing, Juni.

source: Aku mengalami beberapa komplikasi kerusakan organ, dan peluang hidupku kecil
en: because I had a number of organ damage issues, my chances of survival were extremely low.

source: sama.. aku lagi bosen aja sih-
en: and I’m just bored, you know...

source: aku hidup di dua dunia yang sangat melelahkan
en: It's exhausting to live in two worlds.

source: TAPI BENTUK KAKEK-KAKEKNYA NGGA ANEH-ANEH KOK
en: but he didn’t look like anything weird.

source: setelah dua hari di perjalanan kami akhirnya sampai di kampung halaman kami
en: we finally made it home after a two-day journey.

source: keluar kau bodoh! ini nggak lucu-
en: show yourself, you idiot! it isn’t funny--

source: em...
en: um...

source: bisa-bisa, sebentar
en: yeah, hang on.

source: triing
en: twinkle

source: kalau gitu..
en: then...

source: lalu?
en: and?

source: hiks
en: sob

source: p-p-poling itu..
en: th-the wandering pocong...

source: aku yang melupakan semuanya
en: I was the one who forgot about everything.

source: mungkin karena kamu berteman juga dengannya
en: maybe because you’re friends with him.

source: kamu selalu jadi orang terkuat dan tergila yang pernah kutemui
en: you’ll always be the strongest and the craziest person I’ve ever met.

source: Sampai akhirnya terjadi kecelakaan kereta itu
en: and then that railroad crossing accident happened...

source: di sini setahuku ada 3 toko kacamata
en: last time I checked, there were three eyewear retailers.

source: karena dia sudah memasak untukmu sejak kecil
en: because she's been doing it since you were a child.

source: sraak
en: rustle

source: anakkuuu huhuhu
en: oh, my son...

source: tunggu.. suara itu..?
en: wait... what was that?

source: Aku menunggu hari dimana aku bisa memberitahu Bebeng dan Sam soal identitasku
en: I was waiting for the day when I could tell bebeng and samuel about my identity.

source: kenapa kamu tahu masa laluku!
en: ...and how you knew about my past!

source: bener kok
en: yeah.

source: tolong ambilin kue brownies di kamarmu tadi ibu lupa bawa..
en: get the chocolate brownie in your room, I forgot and left it there.

source: WAA
en: chatter

source: kenapa tiba-tiba muncul-
en: why did it appear out of the blue--

source: jauh...
en: my eyes...

source: iya iya
en: yeah, yeah.

source: Aku ingat beberapa kali mengunjungi rumahmu saat kamu tiba-tiba menghilang dari sekolah
en: I remembered going to your house after you never showed up to school again.

source: dan...
en: and...

source: ngantukk!!
en: I’m so sleepy!

source: h-hati-hati!
en: t-take care!

source: pak alamat ini dimana ya?
en: do you know where this address is?

source: waktu beres-beres tempat tidurnya di rumah sakit, tante nemuin beberapa kertas di bawah bantal
en: when I was making his bed at the hospital, I found some letters under his pillow.

source: aku ini sebenarnya kenapa?
en: what’s wrong with me?

source: apa lagi yang kulupakan?
en: what else could I possibly have forgotten?

source: hii serem juga
en: gosh, it looks so scary.

source: a-apanya yang ‘iya juga’ ?!
en: what do you mean she’s right?

source: tau dong
en: i know a lot.

source: KALAU JADI TEMEN AJA NANTI KITA BISA SALING LUPA KAYAK AKU DAN SI BINTANG
en: if we are just friends, we might drift apart in the same way bintang and I did.

source: apa wujud manusiamu dulu adalah damar..?
en: was damar your name when you were alive?

source: aku sempat merawat anak pertama mereka, sampai akhirnya aku menyewakan rumahku untuk mereka dan pergi ke jakarta
en: I used to look after their first child till I finally rented out my house to them and moved to jakarta.

source: pernah jual ngga mas?
en: have you ever sold it though?

source: tapi yang pasti dia masih suka ngamen di bis atau taman-taman kota sih
en: however, he continued to busk in buses and city parks.

source: anggep aja hadiah kelulusanmu,
en: consider it a graduation present.

source: biasa, lagi benerin komputer
en: you know, messing around with my PC.

source: aduh jadi bingung..
en: which one should I pick?

source: um, ya sudah deh
en: okay, then.

source: aku mau cerita sedikit tentang apa yang terjadi padaku, bebeng, dan sam setelah SMA
en: I wanna tell you a little bit about what happened to me, bebeng, and samuel after high school.

source: sebentar, kususul aja deh ya? iya gapapa, deket kok. tunggu di jembatan sekolah aja gimana?
en: wait, i’ll just pick you up. no, it isn't too far away. so let's meet by the bridge near the school.

source: gimana?
en: how was it?

source: gabisa apa-apa..
en: I don’t...

source: yah jun!
en: oh no, juni!

source: haha jual bajakan ngga ya?
en: do they sell the illegal versions as well?

source: gatau juga
en: I don’t know.

source: ‘damar’ namanya
en: the name’s “damar”.

source: kemana aja sih?
en: where have you been?

source: beneran nih?
en: for real?

source: aku ngga bisa terus-terusan menolongmu seperti tadi!
en: I can't keep rescuing you just like before!

source: ekhem!
en: ahem!

source: ga mungkin sih ada di pedagang kaki lima begini..
en: there’s no way the glasses were sold by a street seller...

source: saya punya sawah dan beberapa balong pak (punya bapak)
en: I have rice fields and fish farms. (his dad’s)

source: sayang!
en: honey!

source: ctak!
en: snap

source: karena tadi abis nonton film pasti aku bakal mikirin film itu
en: because we just watched a film, I might think about it.

source: lalu dia akhirnya juga pindah rumah
en: he then moved out of the neighborhood too.

source: Di hari-hari terakhirku aku benar-benar tidak karuan, kalau kamu melihatku pasti nanti kamu bingung hahaha
en: I was a complete wreck in my final days. if you saw me, i bet you’d be confused as hell, hahaha.

source: di sini aja kok
en: ...have been around.

source: kamu yakin yang nyetir?
en: want me to take the wheel?

source: srak
en: fwip

source: apa sih..
en: the heck...

source: aku juga mikirin cita-citamu apa
en: I'd also think about what your goals are in life.

source: sampai aku nikah ya!
en: ...until I get married someday!

source: yang kulihat benar-benar mimpi buruk...
en: what I saw was a nightmare.

source: ‘kenapa kamu baik padaku?’
en: “why are you being nice to me?”

source: jim!!
en: jimmy!

source: awas kau
en: don’t peek.

source: tap
en: step

source: setelah jenguk damar?
en: you man after visiting damar?

source: makanya aku tanya alasannya padamu
en: that’s why I’m asking you.

source: IYA JADI MAU DIMANAPUN, KAPANPUN, KAMU TETEP KELUARGAKU
en: so no matter where we are or when we meet, we’ll always be a family.

source: tapi akhir-akhir ini...
en: however, lately...

source: eh kemarin nonton film itu gak ?
en: did you watch that movie yesterday?

source: *diusir*
en: *got shooed away*

source: huaaa!!
en: waah!

source: halo, ngga ada kok lis, emang terakhir liat dimana?
en: hello, sorry I couldn’t find it. where did you last see it?.

source: ayo nonton di bioskop
en: let’s watch it there.

source: ayo cepat tidur!
en: come on, go to sleep!

source: kenapa kalian mau temenan sama setan?
en: why did you guys want to be friends with him?

source: saya sudah sarjana hukum pak. dan ingin jadi pengacara yang banyak uang dan pastinya bisa melindungi keluarga saya nanti pak! lalu..
en: I have a law degree and hope to one day be a successful lawyer who can protect and provide for my family in the future, sir!

source: lagi mikir porno dia
en: she must be fantasizing about porn.

source: kamu kenapa?
en: are you okay?

source: hai
en: hi.

source: bak!
en: bam!

source: maksud tuhan tuh apa ya?
en: what does god want from me?

source: ca..
en: caca...

source: katanya gabakal mukul!!
en: you promised you wouldn’t punch me!

source: ada gosip apa bu..?
en: what did I miss?

source: masa takut sih? dasar hantu gajelas
en: seriously? do you call yourself a ghost?

source: halo?
en: hello?

source: ITU!
en: there!

source: bebenggg aku bangga padamuu
en: bebeng, I’m so proud of you!

source: ini kedua anak bebeng dan yuan
en: these two are bebeng and yuan’s children.

source: kalau ngeliat orang rasanya ikutan seneng
en: it joys me as well whenever i see people being in love.

source: oh itu jalan lurus aja mas, nanti sebelum jurang belok kiri, terus kalau ketemu sungai berenang aja mas blablabla
en: oh, just keep going straight, then turn left before the ravine, and if you come across the river, just swim blah blah blah...

source: drap
en: clomp

source: BANGUN AH GELI LIATNYA
en: get up. you look ridiculous.

source: kenapa...
en: why...

source: hahaha kena kamu juni!
en: hahaha, gotcha, juni!

source: masih capek kan?
en: you’re tired, right?

source: aku pake jas juga bisa
en: I could also wear suits

source: ...menyebalkan
en: so annoying.

source: buk
en: thump

source: tapi akhirnya aku egois juga
en: but at the end, I ended up being selfish too.

source: maaf banyak membuatmu menangis
en: I'm sorry if I kept making you cry.

source: bebeng yang tergolong kaya di kampung, di sini bukan apa-apa
en: even bebeng who’s well-off in the countryside, became nothing here.

source: Aku memberitahu namaku berulang kali, tapi kamu benar-benar menutup duniamu
en: I kept repeating my name out loud, but you really disconnected yourself.

source: aku pulang ke rumah lamaku..
en: I returned to my old house...

source: kalau mau bisa pesen dulu, nanti minggu depan dikirim
en: well, you can place your order first, we’ll send it next week.

source: lalu jim akan menghantui keluarganya..? lalu..?
en: his spirit might haunt his family? so what?

source: o-oh...
en: oh...

source: sudah kubilang jangan nyusul
en: I told you no need to pick us up

source: atau Bebeng... kamu ingat kata-katanya saat kamu baru masuk sekolah?
en: or bebeng, do you remember what he said to you on your first day of school?

source: junii ini ibuu..
en: juni, it’s mommy.

source: ep.44 - rasanya
en: ep. 44 - feelings

source: makasih!
en: thank you!

source: tak
en: scribble

source: sejak kapan mereka juga-?!
en: since when did they...?

source: aku.. ngga pernah bilang pada siapapun soal itu
en: I never told anyone about that.

source: menerima kepergiannya
en: to learn that he was gone.

source: yang baru kusadari akhir-akhir ini..
en: lately, I began to realize...

source: ngga tau..
en: ...don’t know.

source: sret
en: scribble

source: aah udah nih?
en: are we done yet?

source: harus naik angkutan umum dulu 4 kali
en: gotta transit four times by public transport to go there.

source: lagi sering sakit ya? ku carikan obat deh
en: feeling under the weather? i’ll get you some meds.

source: oh itu... udah sih
en: oh yeah, I’ve heard about it.

source: jangan tinggalkan aku di kemiskinan dan kebodohan inii
en: please don't leave me to my poverty and idiocy!

source: mala (27 thn)
en: mala (27 years old)

source: mau beli kaset
en: wanna buy some cassettes.

source: buk!
en: bam!

source: hoeek
en: blergh

source: brmmm
en: vroom

source: tapi tidak beberapa lama..
en: but soon after that...

source: adoh!!
en: ouch!

source: BANGUN KAU!
en: get up!

source: ternyata setan mikir juga ya..
en: I had no idea ghosts could think.

source: apa kamu sudah tau tentang asal-usulmu?
en: did you find out about your identity?

source: kita ngapain sih
en: what are we doing?

source: kalian kan juga membohongiku!
en: you guys had also been lying to me!

source: ketemu rumah pak rw-nya?
en: have you found the chief’s house?

source: Aku sangat sedih
en: I was so devastated.

source: kata-kata terakhirnya?
en: ...his last words?

source: kok tiba-tiba ngumpet?
en: why are you hiding all of a sudden?

source: permisi...
en: excuse me.

source: MUKANYA RAMAH..
en: he looks friendly.

source: triliilit
en: riiing

source: tadi..
en: ...he...

source: yang bisa kupelajari dari sam adalah dia selalu melakukan segalanya dengan hati
en: what I can learn from samuel is that he does everything with passion.

source: ah iya
en: ah, right

source: halo beng? kamu dimana?
en: hello, bebeng? where are you?

source: kue brownies..
en: where is it...?

source: hmm bunda ngga bisa sih
en: well, I’m not good at playing guitar.

source: disebuah mall
en: in a mall

source: bisa kalian tidak berpisah lagi?
en: will the three of you remain together...

source: yah begitulah gigihnya seorang bebeng
en: that’s how persistent bebeng is.

source: hah
en: pant

source: apa jangan-jangan kamu udah liat ?
en: or have you, by any chance, encountered one?

source: udah gila ya?!
en: are you crazy?!
